   #                                                  Titanic Exercise I
   #### Practice pandas

![titanic](https://userscontent2.emaze.com/images/a5f68f37-6349-4065-a1fc-921cbe7401b2/958230111417e36d6b3c67ffd7bc3494.jpeg)

First of all, import the needed libraries.

In [65]:
import pandas as pd
import numpy as np
# you will have to import at least another library along the exercise do it in here when the time comes
import random

1. Read in filename and call the variable `titanic`
    - Explore the `titanic` dataset using `info`, `dtypes` & `describe`

In [3]:
filename = "data\\titanic.csv"

In [8]:
titanic = pd.read_csv(filename)
titanic

,pclass,survived,name,sex,age,sibsp,parch,ticket,fare,cabin,embarked,boat,body,home.dest
0,1,1,"Allen, Miss. Elisabeth Walton",female,29.00,0,0,24160,211.3375,B5,S,2,NaN,"St Louis, MO"
1,1,1,"Allison, Master. Hudson Trevor",male,0.92,1,2,113781,151.5500,C22 C26,S,11,NaN,"Montreal, PQ / Chesterville, ON"
2,1,0,"Allison, Miss. Helen Loraine",female,2.00,1,2,113781,151.5500,C22 C26,S,NaN,NaN,"Montreal, PQ / Chesterville, ON"
3,1,0,"Allison, Mr. Hudson Joshua Creighton",male,30.00,1,2,113781,151.5500,C22 C26,S,NaN,135.0,"Montreal, PQ / Chesterville, ON"
4,1,0,"Allison, Mrs. Hudson J C (Bessie Waldo Daniels)",female,25.00,1,2,113781,151.5500,C22 C26,S,NaN,NaN,"Montreal, PQ / Chesterville, ON"
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
1304,3,0,"Zabour, Miss. Hileni",female,14.50,1,0,2665,14.4542,NaN,C,NaN,328.0,NaN
1305,3,0,"Zabour, Miss. Thamine",female,NaN,1,0,2665,14.4542,NaN,C,NaN,NaN,NaN
1306,3,0,"Zakarian, Mr. Mapriededer",male,26.50,0,0,2656,7.2250,NaN,C,NaN,304.0,NaN
1307,3,0,"Zakarian, Mr. Ortin",male,27.00,0,0,2670,7.2250,NaN,C,NaN,NaN,NaN
1308,3,0,"Zimmerman, Mr. Leo",male,29.00,0,0,315082,7.8750,NaN,S,NaN,NaN,NaN

In [10]:
titanic.describe()

,pclass,survived,age,sibsp,parch,fare,body
count,1309.000000,1309.000000,1046.000000,1309.000000,1309.000000,1308.000000,121.000000
mean,2.294882,0.381971,29.881138,0.498854,0.385027,33.295479,160.809917
std,0.837836,0.486055,14.413493,1.041658,0.865560,51.758668,97.696922
min,1.000000,0.000000,0.170000,0.000000,0.000000,0.000000,1.000000
25%,2.000000,0.000000,21.000000,0.000000,0.000000,7.895800,72.000000
50%,3.000000,0.000000,28.000000,0.000000,0.000000,14.454200,155.000000
75%,3.000000,1.000000,39.000000,1.000000,0.000000,31.275000,256.000000
max,3.000000,1.000000,80.000000,8.000000,9.000000,512.329200,328.000000

In [11]:
titanic.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1309 entries, 0 to 1308
Data columns (total 14 columns):
 #   Column     Non-Null Count  Dtype
---  ------     --------------  -----
 0   pclass     1309 non-null   int64
 1   survived   1309 non-null   int64
 2   name       1309 non-null   object
 3   sex        1309 non-null   object
 4   age        1046 non-null   float64
 5   sibsp      1309 non-null   int64
 6   parch      1309 non-null   int64
 7   ticket     1309 non-null   object
 8   fare       1308 non-null   float64
 9   cabin      295 non-null    object
 10  embarked   1307 non-null   object
 11  boat       486 non-null    object
 12  body       121 non-null    float64
 13  home.dest  745 non-null    object
dtypes: float64(3), int64(4), object(7)
memory usage: 143.3+ KB

In [13]:
titanic.dtypes

pclass         int64
survived       int64
name          object
sex           object
age          float64
sibsp          int64
parch          int64
ticket        object
fare         float64
cabin         object
embarked      object
boat          object
body         float64
home.dest     object
dtype: object

2. Create a separate dataframe with the columns `['name', 'sex', 'age']`, call it `people`

It can be done two ways, do it both!

In [23]:
people = titanic[['name','sex', 'age']]
people

                                                 name     sex    age
0                       Allen, Miss. Elisabeth Walton  female  29.00
1                      Allison, Master. Hudson Trevor    male   0.92
2                        Allison, Miss. Helen Loraine  female   2.00
3                Allison, Mr. Hudson Joshua Creighton    male  30.00
4     Allison, Mrs. Hudson J C (Bessie Waldo Daniels)  female  25.00
...                                               ...     ...    ...
1304                             Zabour, Miss. Hileni  female  14.50
1305                            Zabour, Miss. Thamine  female    NaN
1306                        Zakarian, Mr. Mapriededer    male  26.50
1307                              Zakarian, Mr. Ortin    male  27.00
1308                               Zimmerman, Mr. Leo    male  29.00

[1309 rows x 3 columns]

In [35]:
people = titanic.iloc[:,2:5]
people

                                                 name     sex    age
0                       Allen, Miss. Elisabeth Walton  female  29.00
1                      Allison, Master. Hudson Trevor    male   0.92
2                        Allison, Miss. Helen Loraine  female   2.00
3                Allison, Mr. Hudson Joshua Creighton    male  30.00
4     Allison, Mrs. Hudson J C (Bessie Waldo Daniels)  female  25.00
...                                               ...     ...    ...
1304                             Zabour, Miss. Hileni  female  14.50
1305                            Zabour, Miss. Thamine  female    NaN
1306                        Zakarian, Mr. Mapriededer    male  26.50
1307                              Zakarian, Mr. Ortin    male  27.00
1308                               Zimmerman, Mr. Leo    male  29.00

[1309 rows x 3 columns]

3. Print the output of `people` showing the first three rows and the last four rows, using `append`,`tail` and `head`

In [36]:
print(people.head(3))
print(people.tail(4))

                             name     sex    age
0   Allen, Miss. Elisabeth Walton  female  29.00
1  Allison, Master. Hudson Trevor    male   0.92
2    Allison, Miss. Helen Loraine  female   2.00
                           name     sex   age
1305      Zabour, Miss. Thamine  female   NaN
1306  Zakarian, Mr. Mapriededer    male  26.5
1307        Zakarian, Mr. Ortin    male  27.0
1308         Zimmerman, Mr. Leo    male  29.0

4. Slice the row from 3 to 9, call it `s_titanic`

In [39]:
s_titanic = titanic.iloc[3:10,:]
s_titanic

,pclass,survived,name,sex,age,sibsp,parch,ticket,fare,cabin,embarked,boat,body,home.dest
3,1,0,"Allison, Mr. Hudson Joshua Creighton",male,30.0,1,2,113781,151.5500,C22 C26,S,NaN,135.0,"Montreal, PQ / Chesterville, ON"
4,1,0,"Allison, Mrs. Hudson J C (Bessie Waldo Daniels)",female,25.0,1,2,113781,151.5500,C22 C26,S,NaN,NaN,"Montreal, PQ / Chesterville, ON"
5,1,1,"Anderson, Mr. Harry",male,48.0,0,0,19952,26.5500,E12,S,3,NaN,"New York, NY"
6,1,1,"Andrews, Miss. Kornelia Theodosia",female,63.0,1,0,13502,77.9583,D7,S,10,NaN,"Hudson, NY"
7,1,0,"Andrews, Mr. Thomas Jr",male,39.0,0,0,112050,0.0000,A36,S,NaN,NaN,"Belfast, NI"
8,1,1,"Appleton, Mrs. Edward Dale (Charlotte Lamson)",female,53.0,2,0,11769,51.4792,C101,S,D,NaN,"Bayside, Queens, NY"
9,1,0,"Artagaveytia, Mr. Ramon",male,71.0,0,0,PC 17609,49.5042,NaN,C,NaN,22.0,"Montevideo, Uruguay"

5. Slice the row from 40 to 63 in reverse order, call it `s_titanic_rev`

In [47]:
#https://www.marsja.se/six-ways-to-reverse-pandas-dataframe/

s_titanic_rev = titanic.loc[63:40:-1]
s_titanic_rev

,pclass,survived,name,sex,age,sibsp,parch,ticket,fare,cabin,embarked,boat,body,home.dest
63,1,1,"Chaffee, Mrs. Herbert Fuller (Carrie Constance...",female,47.0,1,0,W.E.P. 5734,61.1750,E31,S,4,NaN,"Amenia, ND"
62,1,0,"Chaffee, Mr. Herbert Fuller",male,46.0,1,0,W.E.P. 5734,61.1750,E31,S,NaN,NaN,"Amenia, ND"
61,1,1,"Cavendish, Mrs. Tyrell William (Julia Florence...",female,76.0,1,0,19877,78.8500,C46,S,6,NaN,"Little Onn Hall, Staffs"
60,1,0,"Cavendish, Mr. Tyrell William",male,36.0,1,0,19877,78.8500,C46,S,NaN,172.0,"Little Onn Hall, Staffs"
59,1,1,"Cassebeer, Mrs. Henry Arthur Jr (Eleanor Genev...",female,NaN,0,0,17770,27.7208,NaN,C,5,NaN,"New York, NY"
58,1,0,"Case, Mr. Howard Brown",male,49.0,0,0,19924,26.0000,NaN,S,NaN,NaN,"Ascot, Berkshire / Rochester, NY"
57,1,1,"Carter, Mrs. William Ernest (Lucile Polk)",female,36.0,1,2,113760,120.0000,B96 B98,S,4,NaN,"Bryn Mawr, PA"
56,1,1,"Carter, Mr. William Ernest",male,36.0,1,2,113760,120.0000,B96 B98,S,C,NaN,"Bryn Mawr, PA"
55,1,1,"Carter, Miss. Lucile Polk",female,14.0,1,2,113760,120.0000,B96 B98,S,4,NaN,"Bryn Mawr, PA"
54,1,1,"Carter, Master. William Thornton II",male,11.0,1,2,113760,120.0000,B96 B98,S,4,NaN,"Bryn Mawr, PA"
53,1,0,"Carrau, Mr. Jose Pedro",male,17.0,0,0,113059,47.1000,NaN,S,NaN,NaN,"Montevideo, Uruguay"
52,1,0,"Carrau, Mr. Francisco M",male,28.0,0,0,113059,47.1000,NaN,S,NaN,NaN,"Montevideo, Uruguay"
51,1,0,"Carlsson, Mr. Frans Olof",male,33.0,0,0,695,5.0000,B51 B53 B55,S,NaN,NaN,"New York, NY"
50,1,1,"Cardeza, Mrs. James Warburton Martinez (Charlo...",female,58.0,0,1,PC 17755,512.3292,B51 B53 B55,C,3,NaN,"Germantown, Philadelphia, PA"
49,1,1,"Cardeza, Mr. Thomas Drake Martinez",male,36.0,0,1,PC 17755,512.3292,B51 B53 B55,C,3,NaN,"Austria-Hungary / Germantown, Philadelphia, PA"
48,1,1,"Candee, Mrs. Edward (Helen Churchill Hungerford)",female,53.0,0,0,PC 17606,27.4458,NaN,C,6,NaN,"Washington, DC"
47,1,1,"Calderhead, Mr. Edward Pennington",male,42.0,0,0,PC 17476,26.2875,E24,S,5,NaN,"New York, NY"
46,1,0,"Cairns, Mr. Alexander",male,NaN,0,0,113798,31.0000,NaN,S,NaN,NaN,NaN
45,1,0,"Butt, Major. Archibald Willingham",male,45.0,0,0,113050,26.5500,B38,S,NaN,NaN,"Washington, DC"
44,1,1,"Burns, Miss. Elizabeth Margaret",female,41.0,0,0,16966,134.5000,E40,C,3,NaN,NaN
43,1,1,"Bucknell, Mrs. William Robert (Emma Eliza Ward)",female,60.0,0,0,11813,76.2917,D15,C,8,NaN,"Philadelphia, PA"
42,1,1,"Brown, Mrs. John Murray (Caroline Lane Lamson)",female,59.0,2,0,11769,51.4792,C101,S,D,NaN,"Belmont, MA"
41,1,1,"Brown, Mrs. James Joseph (Margaret Tobin)",female,44.0,0,0,PC 17610,27.7208,B4,C,6,NaN,"Denver, CO"
40,1,0,"Brewe, Dr. Arthur Jackson",male,NaN,0,0,112379,39.6000,NaN,C,NaN,NaN,"Philadelphia, PA"

6. Slice the columns from the starting column to `'parch'`, call it `left_columns`

In [49]:
left_columns = titanic.loc[:, :"parch"]
left_columns

,pclass,survived,name,sex,age,sibsp,parch
0,1,1,"Allen, Miss. Elisabeth Walton",female,29.00,0,0
1,1,1,"Allison, Master. Hudson Trevor",male,0.92,1,2
2,1,0,"Allison, Miss. Helen Loraine",female,2.00,1,2
3,1,0,"Allison, Mr. Hudson Joshua Creighton",male,30.00,1,2
4,1,0,"Allison, Mrs. Hudson J C (Bessie Waldo Daniels)",female,25.00,1,2
...,...,...,...,...,...,...,...
1304,3,0,"Zabour, Miss. Hileni",female,14.50,1,0
1305,3,0,"Zabour, Miss. Thamine",female,NaN,1,0
1306,3,0,"Zakarian, Mr. Mapriededer",male,26.50,0,0
1307,3,0,"Zakarian, Mr. Ortin",male,27.00,0,0
1308,3,0,"Zimmerman, Mr. Leo",male,29.00,0,0

7. Slice the columns from `'name'` to `'age'`, call it `middle_columns`

In [50]:
middle_columns = titanic.loc[:, 'name':'age']
middle_columns

                                                 name     sex    age
0                       Allen, Miss. Elisabeth Walton  female  29.00
1                      Allison, Master. Hudson Trevor    male   0.92
2                        Allison, Miss. Helen Loraine  female   2.00
3                Allison, Mr. Hudson Joshua Creighton    male  30.00
4     Allison, Mrs. Hudson J C (Bessie Waldo Daniels)  female  25.00
...                                               ...     ...    ...
1304                             Zabour, Miss. Hileni  female  14.50
1305                            Zabour, Miss. Thamine  female    NaN
1306                        Zakarian, Mr. Mapriededer    male  26.50
1307                              Zakarian, Mr. Ortin    male  27.00
1308                               Zimmerman, Mr. Leo    male  29.00

[1309 rows x 3 columns]

8. Slice the columns from `'ticket'` to the end, call it `right_columns`

In [51]:
right_columns = titanic.loc[:, 'ticket':]
right_columns

,ticket,fare,cabin,embarked,boat,body,home.dest
0,24160,211.3375,B5,S,2,NaN,"St Louis, MO"
1,113781,151.5500,C22 C26,S,11,NaN,"Montreal, PQ / Chesterville, ON"
2,113781,151.5500,C22 C26,S,NaN,NaN,"Montreal, PQ / Chesterville, ON"
3,113781,151.5500,C22 C26,S,NaN,135.0,"Montreal, PQ / Chesterville, ON"
4,113781,151.5500,C22 C26,S,NaN,NaN,"Montreal, PQ / Chesterville, ON"
...,...,...,...,...,...,...,...
1304,2665,14.4542,NaN,C,NaN,328.0,NaN
1305,2665,14.4542,NaN,C,NaN,NaN,NaN
1306,2656,7.2250,NaN,C,NaN,304.0,NaN
1307,2670,7.2250,NaN,C,NaN,NaN,NaN
1308,315082,7.8750,NaN,S,NaN,NaN,NaN

9. What is the name of the oldest person who died in the Titanic? Was he or she travelling alone or had any family travelling with them?

In [59]:
died = titanic['survived'] == 0
died = titanic[died]
column = died["age"]
max_index = column.idxmax()
titanic.iloc[max_index]

pclass                         3
survived                       0
name         Svensson, Mr. Johan
sex                         male
age                         74.0
sibsp                          0
parch                          0
ticket                    347060
fare                       7.775
cabin                        NaN
embarked                       S
boat                         NaN
body                         NaN
home.dest                    NaN
Name: 1235, dtype: object

In order to give an answer to the second question you should find out which columns give you that info. Usually part of your job as a Data Scientist will be get to know the dataset which you are working with. In this case the columns which give you that info are the following: 
        - 'sibsp' Number of Siblings/Spouses Aboard
        - 'parch' Number of Parents/Children Aboard

In [64]:
print('Name: ', titanic.loc[1235, 'name'])
print('Age: ', titanic.loc[1235, 'age'])
print('Number of siblings/Spouses Aboard: ', titanic.loc[1235, 'sibsp'])
print('Number of Parents/Children Aboard: ', titanic.loc[1235, 'parch'])

Name:  Svensson, Mr. Johan
Age:  74.0
Number of siblings/Spouses Aboard:  0
Number of Parents/Children Aboard:  0

10. Create the list of 5 random numbers of rows from 0 to the lenght of the dataframe, call it `rows`

ex. `rows = [3,7,99,52,48]` use `random` library

In [69]:
rows = random.sample(range(0, (len(titanic))), 5)
rows

[340, 183, 568, 656, 916]

This list of numbers are random, could be different.

11. Create the list of three column labels, call it `cols`

In [76]:
cols = ['name','sex', 'age']
cols

['name', 'sex', 'age']

12. Use both lists `rows` and `cols` to create a new dataframe

In [83]:
newdf = titanic.loc[rows]
newdf = newdf.loc[:, cols]
newdf

                                                  name     sex   age
340                        Becker, Miss. Marion Louise  female   4.0
183                             Lesurer, Mr. Gustave J    male  35.0
568                                  Swane, Mr. George    male  18.5
656  Backstrom, Mrs. Karl Alfred (Maria Mathilda Gu...  female  33.0
916                                 Karun, Miss. Manca  female   4.0

13. Create a boolean array with the condition of being a woman or a man, using the `sex` column, where **female** is True. Call it `array_fe`

Bonus: Rename the column `"sex"` to `"gender"`

In [87]:
titanic['array_fe'] = titanic['sex'] == 'female'
titanic.rename(columns={"sex": "gender"}, inplace=True)
titanic

,pclass,survived,name,gender,age,sibsp,parch,ticket,fare,cabin,embarked,boat,body,home.dest,array_fe
0,1,1,"Allen, Miss. Elisabeth Walton",female,29.00,0,0,24160,211.3375,B5,S,2,NaN,"St Louis, MO",True
1,1,1,"Allison, Master. Hudson Trevor",male,0.92,1,2,113781,151.5500,C22 C26,S,11,NaN,"Montreal, PQ / Chesterville, ON",False
2,1,0,"Allison, Miss. Helen Loraine",female,2.00,1,2,113781,151.5500,C22 C26,S,NaN,NaN,"Montreal, PQ / Chesterville, ON",True
3,1,0,"Allison, Mr. Hudson Joshua Creighton",male,30.00,1,2,113781,151.5500,C22 C26,S,NaN,135.0,"Montreal, PQ / Chesterville, ON",False
4,1,0,"Allison, Mrs. Hudson J C (Bessie Waldo Daniels)",female,25.00,1,2,113781,151.5500,C22 C26,S,NaN,NaN,"Montreal, PQ / Chesterville, ON",True
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
1304,3,0,"Zabour, Miss. Hileni",female,14.50,1,0,2665,14.4542,NaN,C,NaN,328.0,NaN,True
1305,3,0,"Zabour, Miss. Thamine",female,NaN,1,0,2665,14.4542,NaN,C,NaN,NaN,NaN,True
1306,3,0,"Zakarian, Mr. Mapriededer",male,26.50,0,0,2656,7.2250,NaN,C,NaN,304.0,NaN,False
1307,3,0,"Zakarian, Mr. Ortin",male,27.00,0,0,2670,7.2250,NaN,C,NaN,NaN,NaN,False
1308,3,0,"Zimmerman, Mr. Leo",male,29.00,0,0,315082,7.8750,NaN,S,NaN,NaN,NaN,False

14. Filter the `titanic` dataframe with the boolean array, call it `woman_titanic`

In [90]:
woman_titanic = titanic['array_fe'] == True
woman_titanic = titanic[woman_titanic]
woman_titanic

,pclass,survived,name,gender,age,sibsp,parch,ticket,fare,cabin,embarked,boat,body,home.dest,array_fe
0,1,1,"Allen, Miss. Elisabeth Walton",female,29.0,0,0,24160,211.3375,B5,S,2,NaN,"St Louis, MO",True
2,1,0,"Allison, Miss. Helen Loraine",female,2.0,1,2,113781,151.5500,C22 C26,S,NaN,NaN,"Montreal, PQ / Chesterville, ON",True
4,1,0,"Allison, Mrs. Hudson J C (Bessie Waldo Daniels)",female,25.0,1,2,113781,151.5500,C22 C26,S,NaN,NaN,"Montreal, PQ / Chesterville, ON",True
6,1,1,"Andrews, Miss. Kornelia Theodosia",female,63.0,1,0,13502,77.9583,D7,S,10,NaN,"Hudson, NY",True
8,1,1,"Appleton, Mrs. Edward Dale (Charlotte Lamson)",female,53.0,2,0,11769,51.4792,C101,S,D,NaN,"Bayside, Queens, NY",True
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
1286,3,1,"Whabee, Mrs. George Joseph (Shawneene Abi-Saab)",female,38.0,0,0,2688,7.2292,NaN,C,C,NaN,NaN,True
1290,3,1,"Wilkes, Mrs. James (Ellen Needs)",female,47.0,1,0,363272,7.0000,NaN,S,NaN,NaN,NaN,True
1300,3,1,"Yasbeck, Mrs. Antoni (Selini Alexander)",female,15.0,1,0,2659,14.4542,NaN,C,NaN,NaN,NaN,True
1304,3,0,"Zabour, Miss. Hileni",female,14.5,1,0,2665,14.4542,NaN,C,NaN,328.0,NaN,True
1305,3,0,"Zabour, Miss. Thamine",female,NaN,1,0,2665,14.4542,NaN,C,NaN,NaN,NaN,True

15. How many woman were younger than 18? Call the variable `minor_wo`

In [96]:
minor_wo = len(woman_titanic[woman_titanic['age'] < 18])
minor_wo

72

16. How many woman that were less than 18 actually died? Call the variable `dead_wo`

In [99]:
dead_wo = woman_titanic[woman_titanic['age'] < 18]
dead_wo = len(dead_wo[dead_wo['survived'] == 0])
dead_wo

22

17. Drop rows with *Nan* in `titanic` with `how='any'` and print the shape

In [112]:
titanic.dropna(how='any').shape

(0, 15)

18. Drop rows with *Nan* in `titanic` with `how='all'` and print the shape

In [113]:
titanic.dropna(how='all').shape

(1309, 15)

Check in [here](https://pandas.pydata.org/pandas-docs/stable/reference/api/pandas.DataFrame.dropna.html) why the shapes are different.

19. Drop columns in `titanic` with more than 1000 missing values and print the columns remaining

In [114]:
titanic.dropna(axis='columns', thresh=1000)

,pclass,survived,name,gender,age,sibsp,parch,ticket,fare,embarked,array_fe
0,1,1,"Allen, Miss. Elisabeth Walton",female,29.00,0,0,24160,211.3375,S,True
1,1,1,"Allison, Master. Hudson Trevor",male,0.92,1,2,113781,151.5500,S,False
2,1,0,"Allison, Miss. Helen Loraine",female,2.00,1,2,113781,151.5500,S,True
3,1,0,"Allison, Mr. Hudson Joshua Creighton",male,30.00,1,2,113781,151.5500,S,False
4,1,0,"Allison, Mrs. Hudson J C (Bessie Waldo Daniels)",female,25.00,1,2,113781,151.5500,S,True
...,...,...,...,...,...,...,...,...,...,...,...
1304,3,0,"Zabour, Miss. Hileni",female,14.50,1,0,2665,14.4542,C,True
1305,3,0,"Zabour, Miss. Thamine",female,NaN,1,0,2665,14.4542,C,True
1306,3,0,"Zakarian, Mr. Mapriededer",male,26.50,0,0,2656,7.2250,C,False
1307,3,0,"Zakarian, Mr. Ortin",male,27.00,0,0,2670,7.2250,C,False
1308,3,0,"Zimmerman, Mr. Leo",male,29.00,0,0,315082,7.8750,S,False

20. Calculate the ratio of missing values at the `boat` column.

In [120]:
percent_missing = titanic['boat'].isnull().sum() * 100 / len(titanic)
print('percent_missing: ', percent_missing)

percent_missing:  62.87242169595111

21.  Group `titanic` by `'pclass'` and aggregate by the columns `age` & `fare`, by `max` and `median` --> `by_class`

In [125]:
byclass = titanic.groupby(['pclass']).agg({'age': ['max','median'], 'fare': ['max','median']})
byclass

         age             fare
         max median       max   median
pclass
1       80.0   39.0  512.3292  60.0000
2       70.0   29.0   73.5000  15.0458
3       74.0   24.0   69.5500   8.0500

22. Print the maximum age in each class from `by_class`

In [139]:
for index, row in byclass.iterrows():
    print("Max age in pclass", index, byclass.iloc[(index -1), 0])

Max age in pclass 1 80.0
Max age in pclass 2 70.0
Max age in pclass 3 74.0

23. Print the median fare in each class from `by_class`

In [140]:
for index, row in byclass.iterrows():
    print("Median fare in pclass", index, byclass.iloc[(index -1), 3])

Median fare in pclass 1 60.0
Median fare in pclass 2 15.0458
Median fare in pclass 3 8.05

24. Using [`.pivot_table()`](https://pandas.pydata.org/pandas-docs/stable/reference/api/pandas.pivot_table.html) to count how many women or men survived by class, call it `counted`.

Don't panic and read the documentation!

In [170]:
counted = pd.pivot_table(titanic, values='survived', columns='gender', index=['pclass'], aggfunc=np.sum)
counted

gender  female  male
pclass
1          139    61
2           94    25
3          106    75

25. Add a new column with the sum of survived men and women, call it `counted['total']`

In [172]:
#counted = titanic.groupby('pclass').apply(lambda sub: sub.pivot_table(index=['gender'], values=['survived'], aggfunc=np.sum, margins=True, margins_name='Total'))
counted['total'] = counted['female'] + counted['male']
counted

#https://pandas.pydata.org/pandas-docs/stable/reference/api/pandas.pivot_table.html

gender  female  male  total
pclass
1          139    61    200
2           94    25    119
3          106    75    181

26. Sort `counted` by the `'total'` column. In which class the people survived the more?

In [174]:
counted.sort_values(by=['total'], ascending=False)

gender  female  male  total
pclass
1          139    61    200
3          106    75    181
2           94    25    119

27. Please, show only the rows using a mask with the following conditions: 
    - They are woman
    - From third class
    - Younger than 30
    - They survived
    
    Â¿How many rows fulfill the condition?

In [189]:
print(len(titanic[(titanic['gender'] == 'female') & (titanic['pclass'] == 3) & (titanic['age'] < 30) & (titanic['survived'] == 1)]))

57

28. Now, show only the rows using `.loc` with the following conditions: 
    - They are man
    - From first class
    - Older than 50
    - They died
    
    Â¿How many rows fulfill the condition?

In [190]:
#https://kanoki.org/2020/01/21/pandas-dataframe-filter-with-multiple-conditions/

#df.loc[(df['Salary_in_1000']>=100) & (df['Age']< 60) & (df['FT_Team'].str.startswith('S')),['Name','FT_Team']]
print(len(titanic.loc[(titanic['gender'] == 'male') & (titanic['pclass'] == 1) & (titanic['age'] >50) & (titanic['survived'] == 0)]))

29

29. Print the uniques values at the column `'name'`

In [192]:
g = titanic.name.unique()
for i in g:
    print(i)

Allen, Miss. Elisabeth Walton
Allison, Master. Hudson Trevor
Allison, Miss. Helen Loraine
Allison, Mr. Hudson Joshua Creighton
Allison, Mrs. Hudson J C (Bessie Waldo Daniels)
Anderson, Mr. Harry
Andrews, Miss. Kornelia Theodosia
Andrews, Mr. Thomas Jr
Appleton, Mrs. Edward Dale (Charlotte Lamson)
Artagaveytia, Mr. Ramon
Astor, Col. John Jacob
Astor, Mrs. John Jacob (Madeleine Talmadge Force)
Aubart, Mme. Leontine Pauline
Barber, Miss. Ellen "Nellie"
Barkworth, Mr. Algernon Henry Wilson
Baumann, Mr. John D
Baxter, Mr. Quigg Edmond
Baxter, Mrs. James (Helene DeLaudeniere Chaput)
Bazzani, Miss. Albina
Beattie, Mr. Thomson
Beckwith, Mr. Richard Leonard
Beckwith, Mrs. Richard Leonard (Sallie Monypeny)
Behr, Mr. Karl Howell
Bidois, Miss. Rosalie
Bird, Miss. Ellen
Birnbaum, Mr. Jakob
Bishop, Mr. Dickinson H
Bishop, Mrs. Dickinson H (Helen Walton)
Bissette, Miss. Amelia
Bjornstrom-Steffansson, Mr. Mauritz Hakan
Blackwell, Mr. Stephen Weart
Blank, Mr. Henry
Bonnell, Miss. Caroline
Bonnell, Miss. Elizabeth
Borebank, Mr. John James
Bowen, Miss. Grace Scott
Bowerman, Miss. Elsie Edith
Bradley, Mr. George ("George Arthur Brayton")
Brady, Mr. John Bertram
Brandeis, Mr. Emil
Brewe, Dr. Arthur Jackson
Brown, Mrs. James Joseph (Margaret Tobin)
Brown, Mrs. John Murray (Caroline Lane Lamson)
Bucknell, Mrs. William Robert (Emma Eliza Ward)
Burns, Miss. Elizabeth Margaret
Butt, Major. Archibald Willingham
Cairns, Mr. Alexander
Calderhead, Mr. Edward Pennington
Candee, Mrs. Edward (Helen Churchill Hungerford)
Cardeza, Mr. Thomas Drake Martinez
Cardeza, Mrs. James Warburton Martinez (Charlotte Wardle Drake)
Carlsson, Mr. Frans Olof
Carrau, Mr. Francisco M
Carrau, Mr. Jose Pedro
Carter, Master. William Thornton II
Carter, Miss. Lucile Polk
Carter, Mr. William Ernest
Carter, Mrs. William Ernest (Lucile Polk)
Case, Mr. Howard Brown
Cassebeer, Mrs. Henry Arthur Jr (Eleanor Genevieve Fosdick)
Cavendish, Mr. Tyrell William
Cavendish, Mrs. Tyrell William (Julia Florence Siegel)
Chaffee, Mr. Herbert Fuller
Chaffee, Mrs. Herbert Fuller (Carrie Constance Toogood)
Chambers, Mr. Norman Campbell
Chambers, Mrs. Norman Campbell (Bertha Griggs)
Chaudanson, Miss. Victorine
Cherry, Miss. Gladys
Chevre, Mr. Paul Romaine
Chibnall, Mrs. (Edith Martha Bowerman)
Chisholm, Mr. Roderick Robert Crispin
Clark, Mr. Walter Miller
Clark, Mrs. Walter Miller (Virginia McDowell)
Cleaver, Miss. Alice
Clifford, Mr. George Quincy
Colley, Mr. Edward Pomeroy
Compton, Miss. Sara Rebecca
Compton, Mr. Alexander Taylor Jr
Compton, Mrs. Alexander Taylor (Mary Eliza Ingersoll)
Cornell, Mrs. Robert Clifford (Malvina Helen Lamson)
Crafton, Mr. John Bertram
Crosby, Capt. Edward Gifford
Crosby, Miss. Harriet R
Crosby, Mrs. Edward Gifford (Catherine Elizabeth Halstead)
Cumings, Mr. John Bradley
Cumings, Mrs. John Bradley (Florence Briggs Thayer)
Daly, Mr. Peter Denis
Daniel, Mr. Robert Williams
Daniels, Miss. Sarah
Davidson, Mr. Thornton
Davidson, Mrs. Thornton (Orian Hays)
Dick, Mr. Albert Adrian
Dick, Mrs. Albert Adrian (Vera Gillespie)
Dodge, Dr. Washington
Dodge, Master. Washington
Dodge, Mrs. Washington (Ruth Vidaver)
Douglas, Mr. Walter Donald
Douglas, Mrs. Frederick Charles (Mary Helene Baxter)
Douglas, Mrs. Walter Donald (Mahala Dutton)
Duff Gordon, Lady. (Lucille Christiana Sutherland) ("Mrs Morgan")
Duff Gordon, Sir. Cosmo Edmund ("Mr Morgan")
Dulles, Mr. William Crothers
Earnshaw, Mrs. Boulton (Olive Potter)
Endres, Miss. Caroline Louise
Eustis, Miss. Elizabeth Mussey
Evans, Miss. Edith Corse
Farthing, Mr. John
Flegenheim, Mrs. Alfred (Antoinette)
Fleming, Miss. Margaret
Flynn, Mr. John Irwin ("Irving")
Foreman, Mr. Benjamin Laventall
Fortune, Miss. Alice Elizabeth
Fortune, Miss. Ethel Flora
Fortune, Miss. Mabel Helen
Fortune, Mr. Charles Alexander
Fortune, Mr. Mark
Fortune, Mrs. Mark (Mary McDougald)
Francatelli, Miss. Laura Mabel
Franklin, Mr. Thomas Parham
Frauenthal, Dr. Henry William
Frauenthal, Mr. Isaac Gerald
Frauenthal, Mrs. Henry William (Clara Heinsheimer)
Frolicher, Miss. Hedwig Margaritha
Frolicher-Stehli, Mr. Maxmillian
Frolicher-Stehli, Mrs. Maxmillian (Margaretha Emerentia Stehli)
Fry, Mr. Richard
Futrelle, Mr. Jacques Heath
Futrelle, Mrs. Jacques Heath (Lily May Peel)
Gee, Mr. Arthur H
Geiger, Miss. Amalie
Gibson, Miss. Dorothy Winifred
Gibson, Mrs. Leonard (Pauline C Boeson)
Giglio, Mr. Victor
Goldenberg, Mr. Samuel L
Goldenberg, Mrs. Samuel L (Edwiga Grabowska)
Goldschmidt, Mr. George B
Gracie, Col. Archibald IV
Graham, Miss. Margaret Edith
Graham, Mr. George Edward
Graham, Mrs. William Thompson (Edith Junkins)
Greenfield, Mr. William Bertram
Greenfield, Mrs. Leo David (Blanche Strouse)
Guggenheim, Mr. Benjamin
Harder, Mr. George Achilles
Harder, Mrs. George Achilles (Dorothy Annan)
Harper, Mr. Henry Sleeper
Harper, Mrs. Henry Sleeper (Myna Haxtun)
Harrington, Mr. Charles H
Harris, Mr. Henry Birkhardt
Harris, Mrs. Henry Birkhardt (Irene Wallach)
Harrison, Mr. William
Hassab, Mr. Hammad
Hawksford, Mr. Walter James
Hays, Miss. Margaret Bechstein
Hays, Mr. Charles Melville
Hays, Mrs. Charles Melville (Clara Jennings Gregg)
Head, Mr. Christopher
Hilliard, Mr. Herbert Henry
Hipkins, Mr. William Edward
Hippach, Miss. Jean Gertrude
Hippach, Mrs. Louis Albert (Ida Sophia Fischer)
Hogeboom, Mrs. John C (Anna Andrews)
Holverson, Mr. Alexander Oskar
Holverson, Mrs. Alexander Oskar (Mary Aline Towner)
Homer, Mr. Harry ("Mr E Haven")
Hoyt, Mr. Frederick Maxfield
Hoyt, Mr. William Fisher
Hoyt, Mrs. Frederick Maxfield (Jane Anne Forby)
Icard, Miss. Amelie
Isham, Miss. Ann Elizabeth
Ismay, Mr. Joseph Bruce
Jones, Mr. Charles Cresson
Julian, Mr. Henry Forbes
Keeping, Mr. Edwin
Kent, Mr. Edward Austin
Kenyon, Mr. Frederick R
Kenyon, Mrs. Frederick R (Marion)
Kimball, Mr. Edwin Nelson Jr
Kimball, Mrs. Edwin Nelson Jr (Gertrude Parsons)
Klaber, Mr. Herman
Kreuchen, Miss. Emilie
Leader, Dr. Alice (Farnham)
LeRoy, Miss. Bertha
Lesurer, Mr. Gustave J
Lewy, Mr. Ervin G
Lindeberg-Lind, Mr. Erik Gustaf ("Mr Edward Lingrey")
Lindstrom, Mrs. Carl Johan (Sigrid Posse)
Lines, Miss. Mary Conover
Lines, Mrs. Ernest H (Elizabeth Lindsey James)
Long, Mr. Milton Clyde
Longley, Miss. Gretchen Fiske
Loring, Mr. Joseph Holland
Lurette, Miss. Elise
Madill, Miss. Georgette Alexandra
Maguire, Mr. John Edward
Maioni, Miss. Roberta
Marechal, Mr. Pierre
Marvin, Mr. Daniel Warner
Marvin, Mrs. Daniel Warner (Mary Graham Carmichael Farquarson)
Mayne, Mlle. Berthe Antonine ("Mrs de Villiers")
McCaffry, Mr. Thomas Francis
McCarthy, Mr. Timothy J
McGough, Mr. James Robert
Meyer, Mr. Edgar Joseph
Meyer, Mrs. Edgar Joseph (Leila Saks)
Millet, Mr. Francis Davis
Minahan, Dr. William Edward
Minahan, Miss. Daisy E
Minahan, Mrs. William Edward (Lillian E Thorpe)
Mock, Mr. Philipp Edmund
Molson, Mr. Harry Markland
Moore, Mr. Clarence Bloomfield
Natsch, Mr. Charles H
Newell, Miss. Madeleine
Newell, Miss. Marjorie
Newell, Mr. Arthur Webster
Newsom, Miss. Helen Monypeny
Nicholson, Mr. Arthur Ernest
Oliva y Ocana, Dona. Fermina
Omont, Mr. Alfred Fernand
Ostby, Miss. Helene Ragnhild
Ostby, Mr. Engelhart Cornelius
Ovies y Rodriguez, Mr. Servando
Parr, Mr. William Henry Marsh
Partner, Mr. Austen
Payne, Mr. Vivian Ponsonby
Pears, Mr. Thomas Clinton
Pears, Mrs. Thomas (Edith Wearne)
Penasco y Castellana, Mr. Victor de Satode
Penasco y Castellana, Mrs. Victor de Satode (Maria Josefa Perez de Soto y Vallejo)
Perreault, Miss. Anne
Peuchen, Major. Arthur Godfrey
Porter, Mr. Walter Chamberlain
Potter, Mrs. Thomas Jr (Lily Alexenia Wilson)
Reuchlin, Jonkheer. John George
Rheims, Mr. George Alexander Lucien
Ringhini, Mr. Sante
Robbins, Mr. Victor
Robert, Mrs. Edward Scott (Elisabeth Walton McMillan)
Roebling, Mr. Washington Augustus II
Romaine, Mr. Charles Hallace ("Mr C Rolmane")
Rood, Mr. Hugh Roscoe
Rosenbaum, Miss. Edith Louise
Rosenshine, Mr. George ("Mr George Thorne")
Ross, Mr. John Hugo
Rothes, the Countess. of (Lucy Noel Martha Dyer-Edwards)
Rothschild, Mr. Martin
Rothschild, Mrs. Martin (Elizabeth L. Barrett)
Rowe, Mr. Alfred G
Ryerson, Master. John Borie
Ryerson, Miss. Emily Borie
Ryerson, Miss. Susan Parker "Suzette"
Ryerson, Mr. Arthur Larned
Ryerson, Mrs. Arthur Larned (Emily Maria Borie)
Saalfeld, Mr. Adolphe
Sagesser, Mlle. Emma
Salomon, Mr. Abraham L
Schabert, Mrs. Paul (Emma Mock)
Serepeca, Miss. Augusta
Seward, Mr. Frederic Kimber
Shutes, Miss. Elizabeth W
Silverthorne, Mr. Spencer Victor
Silvey, Mr. William Baird
Silvey, Mrs. William Baird (Alice Munger)
Simonius-Blumer, Col. Oberst Alfons
Sloper, Mr. William Thompson
Smart, Mr. John Montgomery
Smith, Mr. James Clinch
Smith, Mr. Lucien Philip
Smith, Mr. Richard William
Smith, Mrs. Lucien Philip (Mary Eloise Hughes)
Snyder, Mr. John Pillsbury
Snyder, Mrs. John Pillsbury (Nelle Stevenson)
Spedden, Master. Robert Douglas
Spedden, Mr. Frederic Oakley
Spedden, Mrs. Frederic Oakley (Margaretta Corning Stone)
Spencer, Mr. William Augustus
Spencer, Mrs. William Augustus (Marie Eugenie)
Stahelin-Maeglin, Dr. Max
Stead, Mr. William Thomas
Stengel, Mr. Charles Emil Henry
Stengel, Mrs. Charles Emil Henry (Annie May Morris)
Stephenson, Mrs. Walter Bertram (Martha Eustis)
Stewart, Mr. Albert A
Stone, Mrs. George Nelson (Martha Evelyn)
Straus, Mr. Isidor
Straus, Mrs. Isidor (Rosalie Ida Blun)
Sutton, Mr. Frederick
Swift, Mrs. Frederick Joel (Margaret Welles Barron)
Taussig, Miss. Ruth
Taussig, Mr. Emil
Taussig, Mrs. Emil (Tillie Mandelbaum)
Taylor, Mr. Elmer Zebley
Taylor, Mrs. Elmer Zebley (Juliet Cummins Wright)
Thayer, Mr. John Borland
Thayer, Mr. John Borland Jr
Thayer, Mrs. John Borland (Marian Longstreth Morris)
Thorne, Mrs. Gertrude Maybelle
Tucker, Mr. Gilbert Milligan Jr
Uruchurtu, Don. Manuel E
Van der hoef, Mr. Wyckoff
Walker, Mr. William Anderson
Ward, Miss. Anna
Warren, Mr. Frank Manley
Warren, Mrs. Frank Manley (Anna Sophia Atkinson)
Weir, Col. John
White, Mr. Percival Wayland
White, Mr. Richard Frasar
White, Mrs. John Stuart (Ella Holmes)
Wick, Miss. Mary Natalie
Wick, Mr. George Dennick
Wick, Mrs. George Dennick (Mary Hitchcock)
Widener, Mr. George Dunton
Widener, Mr. Harry Elkins
Widener, Mrs. George Dunton (Eleanor Elkins)
Willard, Miss. Constance
Williams, Mr. Charles Duane
Williams, Mr. Richard Norris II
Williams-Lambert, Mr. Fletcher Fellows
Wilson, Miss. Helen Alice
Woolner, Mr. Hugh
Wright, Mr. George
Young, Miss. Marie Grice
Abelson, Mr. Samuel
Abelson, Mrs. Samuel (Hannah Wizosky)
Aldworth, Mr. Charles Augustus
Andrew, Mr. Edgardo Samuel
Andrew, Mr. Frank Thomas
Angle, Mr. William A
Angle, Mrs. William A (Florence "Mary" Agnes Hughes)
Ashby, Mr. John
Bailey, Mr. Percy Andrew
Baimbrigge, Mr. Charles Robert
Ball, Mrs. (Ada E Hall)
Banfield, Mr. Frederick James
Bateman, Rev. Robert James
Beane, Mr. Edward
Beane, Mrs. Edward (Ethel Clarke)
Beauchamp, Mr. Henry James
Becker, Master. Richard F
Becker, Miss. Marion Louise
Becker, Miss. Ruth Elizabeth
Becker, Mrs. Allen Oliver (Nellie E Baumgardner)
Beesley, Mr. Lawrence
Bentham, Miss. Lilian W
Berriman, Mr. William John
Botsford, Mr. William Hull
Bowenur, Mr. Solomon
Bracken, Mr. James H
Brown, Miss. Amelia "Mildred"
Brown, Miss. Edith Eileen
Brown, Mr. Thomas William Solomon
Brown, Mrs. Thomas William Solomon (Elizabeth Catherine Ford)
Bryhl, Miss. Dagmar Jenny Ingeborg
Bryhl, Mr. Kurt Arnold Gottfrid
Buss, Miss. Kate
Butler, Mr. Reginald Fenton
Byles, Rev. Thomas Roussel Davids
Bystrom, Mrs. (Karolina)
Caldwell, Master. Alden Gates
Caldwell, Mr. Albert Francis
Caldwell, Mrs. Albert Francis (Sylvia Mae Harbaugh)
Cameron, Miss. Clear Annie
Campbell, Mr. William
Carbines, Mr. William
Carter, Mrs. Ernest Courtenay (Lilian Hughes)
Carter, Rev. Ernest Courtenay
Chapman, Mr. Charles Henry
Chapman, Mr. John Henry
Chapman, Mrs. John Henry (Sara Elizabeth Lawry)
Christy, Miss. Julie Rachel
Christy, Mrs. (Alice Frances)
Clarke, Mr. Charles Valentine
Clarke, Mrs. Charles V (Ada Maria Winfield)
Coleridge, Mr. Reginald Charles
Collander, Mr. Erik Gustaf
Collett, Mr. Sidney C Stuart
Collyer, Miss. Marjorie "Lottie"
Collyer, Mr. Harvey
Collyer, Mrs. Harvey (Charlotte Annie Tate)
Cook, Mrs. (Selena Rogers)
Corbett, Mrs. Walter H (Irene Colvin)
Corey, Mrs. Percy C (Mary Phyllis Elizabeth Miller)
Cotterill, Mr. Henry "Harry"
Cunningham, Mr. Alfred Fleming
Davies, Master. John Morgan Jr
Davies, Mr. Charles Henry
Davies, Mrs. John Morgan (Elizabeth Agnes Mary White)
Davis, Miss. Mary
de Brito, Mr. Jose Joaquim
Deacon, Mr. Percy William
del Carlo, Mr. Sebastiano
del Carlo, Mrs. Sebastiano (Argenia Genovesi)
Denbury, Mr. Herbert
Dibden, Mr. William
Doling, Miss. Elsie
Doling, Mrs. John T (Ada Julia Bone)
Downton, Mr. William James
Drew, Master. Marshall Brines
Drew, Mr. James Vivian
Drew, Mrs. James Vivian (Lulu Thorne Christian)
Duran y More, Miss. Asuncion
Duran y More, Miss. Florentina
Eitemiller, Mr. George Floyd
Enander, Mr. Ingvar
Fahlstrom, Mr. Arne Jonas
Faunthorpe, Mr. Harry
Faunthorpe, Mrs. Lizzie (Elizabeth Anne Wilkinson)
Fillbrook, Mr. Joseph Charles
Fox, Mr. Stanley Hubert
Frost, Mr. Anthony Wood "Archie"
Funk, Miss. Annie Clemmer
Fynney, Mr. Joseph J
Gale, Mr. Harry
Gale, Mr. Shadrach
Garside, Miss. Ethel
Gaskell, Mr. Alfred
Gavey, Mr. Lawrence
Gilbert, Mr. William
Giles, Mr. Edgar
Giles, Mr. Frederick Edward
Giles, Mr. Ralph
Gill, Mr. John William
Gillespie, Mr. William Henry
Givard, Mr. Hans Kristensen
Greenberg, Mr. Samuel
Hale, Mr. Reginald
Hamalainen, Master. Viljo
Hamalainen, Mrs. William (Anna)
Harbeck, Mr. William H
Harper, Miss. Annie Jessie "Nina"
Harper, Rev. John
Harris, Mr. George
Harris, Mr. Walter
Hart, Miss. Eva Miriam
Hart, Mr. Benjamin
Hart, Mrs. Benjamin (Esther Ada Bloomfield)
Herman, Miss. Alice
Herman, Miss. Kate
Herman, Mr. Samuel
Herman, Mrs. Samuel (Jane Laver)
Hewlett, Mrs. (Mary D Kingcome)
Hickman, Mr. Leonard Mark
Hickman, Mr. Lewis
Hickman, Mr. Stanley George
Hiltunen, Miss. Marta
Hocking, Miss. Ellen "Nellie"
Hocking, Mr. Richard George
Hocking, Mr. Samuel James Metcalfe
Hocking, Mrs. Elizabeth (Eliza Needs)
Hodges, Mr. Henry Price
Hold, Mr. Stephen
Hold, Mrs. Stephen (Annie Margaret Hill)
Hood, Mr. Ambrose Jr
Hosono, Mr. Masabumi
Howard, Mr. Benjamin
Howard, Mrs. Benjamin (Ellen Truelove Arman)
Hunt, Mr. George Henry
Ilett, Miss. Bertha
Jacobsohn, Mr. Sidney Samuel
Jacobsohn, Mrs. Sidney Samuel (Amy Frances Christy)
Jarvis, Mr. John Denzil
Jefferys, Mr. Clifford Thomas
Jefferys, Mr. Ernest Wilfred
Jenkin, Mr. Stephen Curnow
Jerwan, Mrs. Amin S (Marie Marthe Thuillard)
Kantor, Mr. Sinai
Kantor, Mrs. Sinai (Miriam Sternin)
Karnes, Mrs. J Frank (Claire Bennett)
Keane, Miss. Nora A
Keane, Mr. Daniel
Kelly, Mrs. Florence "Fannie"
Kirkland, Rev. Charles Leonard
Knight, Mr. Robert J
Kvillner, Mr. Johan Henrik Johannesson
Lahtinen, Mrs. William (Anna Sylfven)
Lahtinen, Rev. William
Lamb, Mr. John Joseph
Laroche, Miss. Louise
Laroche, Miss. Simonne Marie Anne Andree
Laroche, Mr. Joseph Philippe Lemercier
Laroche, Mrs. Joseph (Juliette Marie Louise Lafargue)
Lehmann, Miss. Bertha
Leitch, Miss. Jessie Wills
Lemore, Mrs. (Amelia Milley)
Levy, Mr. Rene Jacques
Leyson, Mr. Robert William Norman
Lingane, Mr. John
Louch, Mr. Charles Alexander
Louch, Mrs. Charles Alexander (Alice Adelaide Slow)
Mack, Mrs. (Mary)
Malachard, Mr. Noel
Mallet, Master. Andre
Mallet, Mr. Albert
Mallet, Mrs. Albert (Antoinette Magnin)
Mangiavacchi, Mr. Serafino Emilio
Matthews, Mr. William John
Maybery, Mr. Frank Hubert
McCrae, Mr. Arthur Gordon
McCrie, Mr. James Matthew
McKane, Mr. Peter David
Mellinger, Miss. Madeleine Violet
Mellinger, Mrs. (Elizabeth Anne Maidment)
Mellors, Mr. William John
Meyer, Mr. August
Milling, Mr. Jacob Christian
Mitchell, Mr. Henry Michael
Montvila, Rev. Juozas
Moraweck, Dr. Ernest
Morley, Mr. Henry Samuel ("Mr Henry Marshall")
Mudd, Mr. Thomas Charles
Myles, Mr. Thomas Francis
Nasser, Mr. Nicholas
Nasser, Mrs. Nicholas (Adele Achem)
Navratil, Master. Edmond Roger
Navratil, Master. Michel M
Navratil, Mr. Michel ("Louis M Hoffman")
Nesson, Mr. Israel
Nicholls, Mr. Joseph Charles
Norman, Mr. Robert Douglas
Nourney, Mr. Alfred ("Baron von Drachstedt")
Nye, Mrs. (Elizabeth Ramell)
Otter, Mr. Richard
Oxenham, Mr. Percy Thomas
Padro y Manent, Mr. Julian
Pain, Dr. Alfred
Pallas y Castello, Mr. Emilio
Parker, Mr. Clifford Richard
Parkes, Mr. Francis "Frank"
Parrish, Mrs. (Lutie Davis)
Pengelly, Mr. Frederick William
Pernot, Mr. Rene
Peruschitz, Rev. Joseph Maria
Phillips, Miss. Alice Frances Louisa
Phillips, Miss. Kate Florence ("Mrs Kate Louise Phillips Marshall")
Phillips, Mr. Escott Robert
Pinsky, Mrs. (Rosa)
Ponesell, Mr. Martin
Portaluppi, Mr. Emilio Ilario Giuseppe
Pulbaum, Mr. Franz
Quick, Miss. Phyllis May
Quick, Miss. Winifred Vera
Quick, Mrs. Frederick Charles (Jane Richards)
Reeves, Mr. David
Renouf, Mr. Peter Henry
Renouf, Mrs. Peter Henry (Lillian Jefferys)
Reynaldo, Ms. Encarnacion
Richard, Mr. Emile
Richards, Master. George Sibley
Richards, Master. William Rowe
Richards, Mrs. Sidney (Emily Hocking)
Ridsdale, Miss. Lucy
Rogers, Mr. Reginald Harry
Rugg, Miss. Emily
Schmidt, Mr. August
Sedgwick, Mr. Charles Frederick Waddington
Sharp, Mr. Percival James R
Shelley, Mrs. William (Imanita Parrish Hall)
Silven, Miss. Lyyli Karoliina
Sincock, Miss. Maude
Sinkkonen, Miss. Anna
Sjostedt, Mr. Ernst Adolf
Slayter, Miss. Hilda Mary
Slemen, Mr. Richard James
Smith, Miss. Marion Elsie
Sobey, Mr. Samuel James Hayden
Stanton, Mr. Samuel Ward
Stokes, Mr. Philip Joseph
Swane, Mr. George
Sweet, Mr. George Frederick
Toomey, Miss. Ellen
Troupiansky, Mr. Moses Aaron
Trout, Mrs. William H (Jessie L)
Troutt, Miss. Edwina Celia "Winnie"
Turpin, Mr. William John Robert
Turpin, Mrs. William John Robert (Dorothy Ann Wonnacott)
Veal, Mr. James
Walcroft, Miss. Nellie
Ware, Mr. John James
Ware, Mr. William Jeffery
Ware, Mrs. John James (Florence Louise Long)
Watson, Mr. Ennis Hastings
Watt, Miss. Bertha J
Watt, Mrs. James (Elizabeth "Bessie" Inglis Milne)
Webber, Miss. Susan
Weisz, Mr. Leopold
Weisz, Mrs. Leopold (Mathilde Francoise Pede)
Wells, Master. Ralph Lester
Wells, Miss. Joan
Wells, Mrs. Arthur Henry ("Addie" Dart Trevaskis)
West, Miss. Barbara J
West, Miss. Constance Mirium
West, Mr. Edwy Arthur
West, Mrs. Edwy Arthur (Ada Mary Worth)
Wheadon, Mr. Edward H
Wheeler, Mr. Edwin "Frederick"
Wilhelms, Mr. Charles
Williams, Mr. Charles Eugene
Wright, Miss. Marion
Yrois, Miss. Henriette ("Mrs Harbeck")
Abbing, Mr. Anthony
Abbott, Master. Eugene Joseph
Abbott, Mr. Rossmore Edward
Abbott, Mrs. Stanton (Rosa Hunt)
Abelseth, Miss. Karen Marie
Abelseth, Mr. Olaus Jorgensen
Abrahamsson, Mr. Abraham August Johannes
Abrahim, Mrs. Joseph (Sophie Halaut Easu)
Adahl, Mr. Mauritz Nils Martin
Adams, Mr. John
Ahlin, Mrs. Johan (Johanna Persdotter Larsson)
Aks, Master. Philip Frank
Aks, Mrs. Sam (Leah Rosen)
Albimona, Mr. Nassef Cassem
Alexander, Mr. William
Alhomaki, Mr. Ilmari Rudolf
Ali, Mr. Ahmed
Ali, Mr. William
Allen, Mr. William Henry
Allum, Mr. Owen George
Andersen, Mr. Albert Karvin
Andersen-Jensen, Miss. Carla Christine Nielsine
Andersson, Master. Sigvard Harald Elias
Andersson, Miss. Ebba Iris Alfrida
Andersson, Miss. Ellis Anna Maria
Andersson, Miss. Erna Alexandra
Andersson, Miss. Ida Augusta Margareta
Andersson, Miss. Ingeborg Constanzia
Andersson, Miss. Sigrid Elisabeth
Andersson, Mr. Anders Johan
Andersson, Mr. August Edvard ("Wennerstrom")
Andersson, Mr. Johan Samuel
Andersson, Mrs. Anders Johan (Alfrida Konstantia Brogren)
Andreasson, Mr. Paul Edvin
Angheloff, Mr. Minko
Arnold-Franchi, Mr. Josef
Arnold-Franchi, Mrs. Josef (Josefine Franchi)
Aronsson, Mr. Ernst Axel Algot
Asim, Mr. Adola
Asplund, Master. Carl Edgar
Asplund, Master. Clarence Gustaf Hugo
Asplund, Master. Edvin Rojj Felix
Asplund, Master. Filip Oscar
Asplund, Miss. Lillian Gertrud
Asplund, Mr. Carl Oscar Vilhelm Gustafsson
Asplund, Mr. Johan Charles
Asplund, Mrs. Carl Oscar (Selma Augusta Emilia Johansson)
Assaf Khalil, Mrs. Mariana ("Miriam")
Assaf, Mr. Gerios
Assam, Mr. Ali
Attalah, Miss. Malake
Attalah, Mr. Sleiman
Augustsson, Mr. Albert
Ayoub, Miss. Banoura
Baccos, Mr. Raffull
Backstrom, Mr. Karl Alfred

30. Find if was there any `name` repeated at the Titanic?

Hint: There were two people with the same name, who?

In [194]:
titanic[titanic.duplicated(['name'])]

,pclass,survived,name,gender,age,sibsp,parch,ticket,fare,cabin,embarked,boat,body,home.dest,array_fe
726,3,0,"Connolly, Miss. Kate",female,30.0,0,0,330972,7.6292,NaN,Q,NaN,NaN,Ireland,True
925,3,0,"Kelly, Mr. James",male,44.0,0,0,363592,8.0500,NaN,S,NaN,NaN,NaN,False

31. Well done! You did it! I can tell you are a real master with Pandas. Please, now save the dataframe as a `.csv` since you will use it in a future exercise `Titanic-Visualisation`. The name of the `.csv` you'll generate should be `titanic_cleaned.csv`.

Use for that aim the following pandas's method: https://pandas.pydata.org/pandas-docs/stable/reference/api/pandas.DataFrame.to_csv.html

Make sure you use the argument `index = False`.

In [196]:
titanic.to_csv('titanic_cleaned.csv', index=False)